{
  "courseTitle": "Local SEO Mastery for 2025",
  "courseDescription": "A comprehensive course that delves into the exact tactics, strategies, and frameworks you need to generate $5k+ per month using local SEO. Includes step-by-step SOPs, transcripts, and expanded commentary on everything from reviews, NAP consistency, Google My Business ranking factors, CTR manipulation, and more.",
  "courseStats": {
    "duration": "4 hours",
    "lessons": "15 Lessons",
    "students": "1,243 Students",
    "certificate": true
  },
  "sections": [
    { "id": "overview-mindset", "title": "Overview & Mindset", "free": true },
    { "id": "local-seo-intro", "title": "Introduction to Local SEO", "free": true },
    { "id": "google-business-profile", "title": "Google Business Profile", "free": true },
    { "id": "citation-building", "title": "Citation Building", "free": false },
    { "id": "review-management", "title": "Review Management", "free": false },
    { "id": "advanced-techniques", "title": "Advanced Techniques", "free": false },
    { "id": "optimization-strategies", "title": "Optimization Strategies", "free": false }
  ],
  "modules": [
    {
      "id": "module-1",
      "title": "Module 1: Overview & Mindset",
      "lessons": [
        {
          "id": "lesson-1-1",
          "title": "Lesson 1: The Key Proposition (Exact Words from SOP)",
          "content": "Doing local seo is the easiest way to $5k/mo in 2025. Here's the complete SOP to get clients and rank (bookmark for later):\n\n1. Ranking is the easy part, getting clients is the hard part\n\n   If you're just starting out, offer ranking guarantees. Ranking is THAT easy, most businesses can rank with small tweaks. Start within your network, friends you went to highschool with etc.\n\n2. Now for the rankings.. the 80/20 without any additional link building or citations is to just get more reviews. 1000 x 5 star reviews won't get you to number 1, but the 2nd or 3rd order effects will help a ton (e.g. higher CTR, review keyword stuffing etc.)\n\n3. LOCATION LOCATION LOCATION. The distance from the searcher is a huge ranking factor. That means if you set your GMB to the boonies and you're trying to target people living in the center, you've just kneecapped yourself and signed up for a marathon.\n\n4. Now comes the fun part... NAP consistency. All of these work, I'll give them to you in the order I'd do them in:\n   - Directory citations (starts at $5 on Fiverr, make sure you index them, localrank.so coming out with a 1-click solution next week)\n   - Jacky's PBN (visit the url in my profile for this)\n   - Local guest posts (visit the same url)\n\n5. Keyword in business name. eg. Indexsy - BEST VANCOUVER SEO COMPANY. Doesn't work as well as in 2024, be careful adding this into your GMB, easy clappening, but still works.\n\n6. CTR manipulation. Yes there's software for it, but I don't like recommending this because mfs overshoot this and get clapped. Most natural way is to do this: Every day when you drive to work, search your brand name + target kw → e.g. indexsy barbershop, and then drive to work. Ask employees to do the same.\n\n7. Other small things. Track your local seo rankings with localrank.so, because you can't optimize what you're not tracking. GMB posts, do it if you have time, not part of my 80/20. On-page seo, minimal impact, but just do it anyways it's easy. Answering reviews, no impact on seo, but good for CRO.\n\n8. That's it. I gave you the complete SOP that people have used to get to $5k+/mo. Ball is in your court now. All I ask, is if this was helpful, engage in my posts (like this one), and use my tools if you're in the market for it."
        },
        {
          "id": "lesson-1-2",
          "title": "Lesson 2: Why Local SEO Works So Well",
          "content": "Local SEO focuses on a smaller, geographically relevant audience. These searchers are more likely to convert because they're looking for a specific local service or business. For agencies or solopreneurs, local SEO offers:\n\n- Rapid ranking potential if the competition is low.\n- The ability to make quick tweaks (NAP consistency, reviews) that can dramatically improve visibility.\n- The opportunity to tap into personal networks or warm leads (former classmates, local connections, existing business owners you know) to get initial clients.\n\nLocal SEO is also the best path to $5k/mo in 2025 because the 'getting clients' part is often the only bottleneck. Once you secure clients, achieving rankings is relatively straightforward with the correct on-page, off-page, and GMB optimization strategies outlined in this entire SOP."
        },
        {
          "id": "lesson-1-3",
          "title": "Lesson 3: Expansion & Commentary",
          "content": "Ranking = straightforward steps, mostly formulaic:\n1. NAP consistency.\n2. Good reviews.\n3. Proximity to searchers.\n4. Reputable citations.\n5. Minimal on-page SEO alignment with local keywords.\n\nThe harder challenge is convincing local businesses to trust you. Offering a ranking guarantee (like a partial or full 'pay on results') can be a bold but effective strategy. Business owners prefer paying for outcomes rather than uncertain SEO retainer fees. But only consider this if you genuinely believe you can rank them.\n\nIf you're new, start with someone in your personal network. The trust factor is already there. Demonstrate your results on that client, gather case studies, and then approach other businesses in that niche.\n\nUse the steps from the SOP:\n- Communicate the importance of location.\n- Emphasize that 2nd or 3rd order effects of good reviews matter.\n- Show them examples of localrank.so or alternative tracking tools that visualize improvements.\n- Deliver results quickly by focusing on the 80/20 (reviews, basic on-page, GMB set-up).\n\nMindset: If you go all-in, local SEO can out-earn many other online side hustles. The margins are high, especially if you become known for producing measurable results."
        }
      ]
    },
    {
      "id": "module-2",
      "title": "Module 2: Introduction to Local SEO",
      "lessons": [
        {
          "id": "lesson-2-1",
          "title": "Lesson 1: Full Transcript – Introduction to Local SEO",
          "content": "All right, what's up guys, um Welcome to advise if you're new to advise if you're here only for the local SEO SOP So I want to say thank you for your support If you're one of those people who just signed up for a month and it's just trying to extract as much value as possible I respect the hustle but you know try to stay on for as many months as you can and just see it as a way to pay your taxes cuz I'm gonna keep it a buck with you. Most of this stuff. I already gave away for free on YouTube just see this SOP as like a Place where every like you can find every single video step by step so on and so forth That's it in this SOP.\nI'll pretty much cover Now consistency Consistency Getting five-star reviews getting a GMB like a Google my business location talking about certain ranking factors like low location vicinity and CTR manipulation pretty much and yeah, that's it"
        },
        {
          "id": "lesson-2-2",
          "title": "Lesson 2: Commentary – Introduction Highlights",
          "content": "The introduction emphasizes the importance of consistency in local SEO:\n- NAP (Name, Address, Phone) consistency across directories.\n- Getting more five-star reviews.\n- Verifying your Google Business Profile (GMB / Google My Business).\n- Understanding location-based ranking factors.\n- Using CTR manipulation (carefully) to enhance GMB performance.\n\nIt also underscores that a lot of the core content is already available in scattered sources (like free YouTube videos), but here you get it in a structured step-by-step SOP. This highlights that local SEO is more about systematic execution than secret knowledge."
        },
        {
          "id": "lesson-2-3",
          "title": "Lesson 3: NAP Consistency + Map Embeds",
          "content": "NAP Consistency is crucial. If you can't maintain consistent Name, Address, Phone across all listings, you risk confusing Google and losing trust. Directory Citations: The simplest approach is to buy cheap Fiverr gigs in batches (e.g., 50 citations, wait two weeks, 50 more, etc.) and then index them. PBNs for Local: Using PBNs (Private Blog Networks) to reference your Name, Address, Phone can be extremely potent if done carefully. Example process:\n- Buy citations → Wait 2 weeks.\n- Buy Jacky's PBN → Wait 2 weeks.\n- Tier your original directory citations with Kevin's PBN (not Jacky's).\n- Potentially purchase local guest posts.\n\nMap Embeds: Embedding your Google Map location in guest posts or websites adds another local signal. Competitor Check: A good way to approximate how many citations you need is to search your competitor in quotes, check the Google results. The number is a rough \"citation count.\" You can overshoot that number to dethrone them."
        }
      ]
    },
    {
      "id": "module-3",
      "title": "Module 3: Building & Maintaining a 5-Star Reputation",
      "lessons": [
        {
          "id": "lesson-3-1",
          "title": "Lesson 1: Getting ONLY 5 Stars Reviews for Google",
          "content": "First and foremost, don't try this if you have a shitty service - it's just not okay. Always prompt a client for review. Anywhere you go, you'll notice the restaurants and places with the highest five-star reviews always prompt you for a Google review. If you do see an uptick in negative reviews, ask your clients to scan a QR code and leave feedback when they're sitting right in front of you. This QR code should go to a review funneler. How review funnelers work: if they rate four stars or higher, you prompt them to leave a review on Google. If they rate three stars or lower, you send them to a contact form. Typically, unhappy clients just want to be heard, so give them an outlet to vent their frustrations. For the people who rated three stars or lower, please help them out and sort it out. If you don't, that low star review will eventually find its way back to you."
        },
        {
          "id": "lesson-3-2",
          "title": "Lesson 2: Five-Star Review Blueprint",
          "content": "1. Prompt People Immediately: The best time to get a review is when the positive experience is fresh. Use physical signage (QR codes) or digital reminders.\n2. Review Funneler: Route 4+ star raters to Google, route 3 stars or less to your feedback form.\n3. Offer Small Incentives: Not strictly white hat if you're giving freebies in exchange for 5 stars, but it's a common tactic. Just don't overdo it or it looks fake.\n4. Handling Negative Feedback: Engagement, resolution, or offline conversation can salvage a situation before it becomes a negative GMB review.\n5. Automate Where Possible: Tools or WordPress plugins can speed up your follow-up process. The more frictionless for the customer, the better your review volume."
        },
        {
          "id": "lesson-3-3",
          "title": "Lesson 3: Expanded Guidance on Reputation Management",
          "content": "In addition to the direct transcript:\n\n- Email & SMS Follow-Ups: If you have a CRM, create automated follow-up sequences that politely request a review a day or two after a service.\n- Leverage POS Systems: Some businesses integrate the request for a review right at the point of sale. For instance, your receipt or invoice can say, \"Enjoyed our service? Please leave a review.\"\n- Handling Fake or Malicious Reviews: If you suspect a review is bogus, you can flag it on Google My Business. However, removal is not guaranteed. Your best recourse is to bury it with legitimate 5-star reviews.\n\nRemember, consistent positive reviews boost not only your ranking but also your click-through rates (CTR) when potential customers see your GMB listing."
        }
      ]
    }
  ]
} 